# <div style = "font-size : 42px; color : #000000 ; font-family : 'Oregon'; text-align : center; background-color : #dba514; border-radius: 5px 5px;"><strong>Bank Churn Prediction</strong></div>

## <div style = "font-size : 35px; color : #f9858b ; font-family : 'Calibri'; text-align : center; background-color : #bdfff6; border-radius: 5px 5px;"><strong>Exploratory Data Analysis (EDA)</strong></div>

<div align="center">
  <img align = 'center' src="https://user-images.githubusercontent.com/58620359/174948746-5dc3418a-8296-4cc8-9561-f8f12ca9a0a4.png" alt="Project Banner" width="1000"/>
</div>

## Introduction

## About

In [1]:
# importing libraries

import warnings
warnings.filterwarnings('ignore')

# data manipulation
import numpy as np
import pandas as pd

# visualization
import seaborn as sns
import plotly.express as px
import matplotlib.pyplot as plt

# style
plt.style.use('fivethirtyeight')
%matplotlib inline

In [2]:
# Loading Dataset
data = pd.read_csv('data/bank_churn.csv')
data.head()

,Unnamed: 0,id,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,0,0,15674932,Okwudilichukwu,668,France,Male,33.0,3,0.00,2,1.0,0.0,181449.97,0
1,1,1,15749177,Okwudiliolisa,627,France,Male,33.0,1,0.00,2,1.0,1.0,49503.50,0
2,2,2,15694510,Hsueh,678,France,Male,40.0,10,0.00,2,1.0,0.0,184866.69,0
3,3,3,15741417,Kao,581,France,Male,34.0,2,148882.54,1,1.0,1.0,84560.88,0
4,4,4,15766172,Chiemenam,716,Spain,Male,33.0,5,0.00,2,1.0,1.0,15068.83,0